{
  "header.wallet": "Connect to Wallet",
  "header.wallet-toast": "Use {{wallet}} to connect your wallet",
  "header.section.trade": "Trade",
  "header.section.liquidity": "Liquidity",
  "header.section.up": "UP",
  "trade.from": "FROM",
  "trade.to": "TO",
  "trade.enter-amount": "Enter amount to trade",
  "trade.submit": "Submit and Approve",
  "trade-successful.title": "Trade Successfully Broadcasted",
  "trade-successful.received": "Received",
  "trade-successful.sent": "Sent",
  "trade-successful.trade-more": "Make another trade",
  "up.title": "Redeem UP Tokens",
  "up.p-1": "Redeeming UP tokens means to send UP tokens to the Unifi protocol. The protocol will return a predetermined amount of base tokens for that blockchain in exchange for the UP tokens. Redeeming UP tokens is an irreversible transaction.",
  "up.invalid-amount": "Typed amount is greater than your balances",
  "up.enter-amount": "Enter amount to Redeem",
  "up.user-expected": "You will receive",
  "up.submit": "Submit and Approve",
  "up-successful.title": "UP Token Redeem Successful",
  "up-successful.received": "Received",
  "up-successful.back": "Back to Home",
  "liquidity.title": "Liquidity",
  "liquidity.p-1": "Liquidity providers earn a share of the fees generated by the uPair where the liquidity is provided. Fees are shared in the form of UP tokens. UP tokens earn a share of the trading fees generated by every trade and from the entire Unifi protocol.",
  "liquidity.join-pool": "Join a Liquidity Pool",
  "liquidity.withdraw-liquidity": "Withdraw Liquidity",
  "liquidity.claim-up-rewards": "Claim your UP Token Rewards",
  "liquidity.pool-join.AperB": "{{tokenA}} per {{tokenB}}",
  "liquidity.pool-join.BperA": "{{tokenB}} per {{tokenA}}",
  "liquidity.pool-join.shareOfPool": "Share of Pool",
  "liquidity.pool-join.input": "INPUT",
  "liquidity.pool-join.input-amount-deposit": "Enter liquidity amount to deposit",
  "liquidity.pool-join.user-liquidity": "Your current liquidity",
  "liquidity.pool-join.submit": "Submit and Approve",
  "liquidity.pool-join.icon.back": "Back",
  "liquidity.pool-join.icon.deposit-token": "Deposit {{token}}",
  "liquidity.pool-join.icon.deposit-base-token": "Deposit {{token}} & Authorize",
  "liquidity.pool-join.icon.deposited-token": "{{token}} deposited",
  "liquidity.pool-join.icon.withdraw-deposited-token": "Withdraw",
  "liquidity.remove-pool.title": "Remove Liquidity",
  "liquidity.remove-pool.p-1": "Redeeming uL tokens withdraws your liquidity and returns the value of that liquidity to your address. This action automatically claims your share of UP tokens earned by that liquidity before withdrawing.",
  "liquidity.remove-pool.p-2": "Redeemed uL tokens leave your address and it is an irreversible transaction. Liquidity providers can remove all or part of their liquidity at any time.",
  "liquidity.remove-pool.table.tokens": "Tokens",
  "liquidity.remove-pool.table.balance": "Balance",
  "liquidity.remove-pool.table.redeem": "Redeem",
  "liquidity.redeem-pool.title": "Redeem {{token}} Tokens",
  "liquidity.redeem-pool.p-1": "Liquidity providers can withdraw all or part of their liquidity at any time by redeeming uL tokens. Redeeming uL tokens will return the value of the liquidity to your address and automatically claim your UP token rewards. Redeemed uL tokens leave your address and is an irreversible transaction.",
  "liquidity.redeem-pool.enter-amount": "Enter amount to Redeem",
  "liquidity.redeem-pool.user-receive": "You will receive",
  "liquidity.redeem-pool.submit": "Submit and Approve",
  "liquidity.claim-rewards.title": "Claim UP Tokens",
  "liquidity.up.title": "Redeem UP Tokens",
  "liquidity.pool.title": "Pooling Liquidity",
  "liquidity.pool.p-1": "Please select the uPair in which you would like to deposit liquidity by pressing the Join button next to it.",
  "liquidity.pool.p-2": "In return for depositing liquidity, you will be issued uL tokens, which represents your deposit and will allow you to withdraw the value of your liquidity at any time. uL tokens will be named after the trading token in each uPair. The uL token for the SEED/TRX uPair is uSEED. uL tokens can be used to claim a share of fees from its specific uPair in the form of UP tokens.",
  "liquidity.pool.table.token-pair": "Token Pair",
  "liquidity.pool.table.token-base": "Token / Base",
  "liquidity.pool.table.total-liquidity": "Total Liquidity",
  "liquidity.pool.table.24h-volume": "24hr Volume",
  "liquidity.pool.table.join": "Join",
  "claim-rewards.claiming-error": "Unable to claim",
  "claim-rewards.title": "Claim UP Tokens",
  "claim-rewards.p-1": "Claiming UP tokens will claim the entire available amount of UP tokens for each uPair funded.",
  "claim-successful.title": "UP Claim Successful",
  "claim-successful.received": "Received",
  "claim-successful.claim-more": "Claim more UP tokens",
  "deposit-successful.title": "Liquidity Deposited",
  "deposit-successful.deposited": "Deposited",
  "deposit-successful.deposit-more": "Deposit more liquidity",
  "remove-pool-successful.title": "{{token}} Redeem Successfully Broadcasted",
  "remove-pool-successful.received": "Received",
  "remove-pool-successful.withdraw-more": "Withdraw more liquidity",
  "transaction-failed.title": "Transaction Failed",
  "transaction-failed.back": "Back",
  "bottom-button-back.label": "Back",
  "input.invalid-amount-typed-1": "Amount typed is not a valid number",
  "input.invalid-amount-typed-2": "Please, review the amount fields",
  "input.balance": "Balance",
  "input.max": "MAX",
  "select.select-token": "Select a token",
  "swap-detail.message": "Please select the tokens to trade",
  "swap-detail.price.label": "Price",
  "swap-detail.price.value": "{{price}} {{tokenA}} per {{tokenB}}",
  "swap-detail.max-trade-size.label": "Max Trade Size",
  "swap-detail.trade-fee.label": "Trade fee",
  "swap-detail.slippage.label": "Slippage",
  "swap-detail.transaction-sequence.title": "Transaction Sequence",
  "swap-detail.transaction-sequence.from": "From",
  "swap-detail.transaction-sequence.to": "To",
  "for-more-info-press-here": "For more information press <2>here</2>.",
  "derivatives-warning.p-1": "Derivative liquidity tokens are tokens given to liquidity providers by DeFi platforms in return for the liquidity provided. An example of another platform would be JustSwap. These tokens represent the value locked into that liquidity pool and are often redeemable on the platform that created them.",
  "derivatives-warning.p-2": "Users who have provided liquidity to another DeFi platform may wish to provide that derivative liquidity token as liquidity on uTrade. This may allow the derivative liquidity token holder to benefit from rewards on the originating platform, while also using the derivative liquidity token to mine UP on uTrade. The same initial liquidity may result in mining rewards on multiple platforms at the same time. Earn More with Unifi.",
  "derivatives-warning.p-3": "To provide liquidity to derivative token uPair:",
  "derivatives-warning.p-3.a": "Some platforms, such as JustSwap, may provide liquidity tokens which are not visible in common wallet applications, like Tronlink. Even if the token is not displayed in Tronlink, uTrade can display and interact with the token.",
  "derivatives-warning.p-3.b": "The user must fund both the trading token and base token in the market determined ratio.",
  "derivatives-warning.p-3.c": "The wallet address used to provide liquidity must be the wallet address that contains the derivative liquidity token. This is normally the address that was used to provide liquidity on the original platform.",
  "derivatives-warning.p-3.d": "uL tokens provided by uTrade for these derivative uPairs will include a reference to the originating platform that issued the original liquidity token. uL tokens are limited to 5 characters.",
  "derivatives-warning.p-3.d.i": "For example, the USDT liquidity token created by JustSwap will display as S-USDT. The uL token issued by uTrade will be uJSUS. This stands for uTrade-JustSwap-USDT.",
  "derivatives-warning.p-3.d.ii": "The USDT liquidity token created by Unifi is uUSDT. The derivative uL token issued by uTrade will be uuUSD.",
  "derivatives-warning.p-4-1": "Traders may wish to purchase derivative liquidity tokens for various reasons, including their potential underlying value.",
  "derivatives-warning.p-4-2": "To trade in a derivative uPair:",
  "derivatives-warning.p-4.a": "The user selects a derivative liquidity token from the dropdown menu which will take them to the derivatives information page. The user must click the “I Agree” button to continue, stating they have read all instructions prior to trading.",
  "derivatives-warning.p-4.b": "Users purchasing derivatives with the intent to redeem them at the originating platform should be aware of the following:",
  "derivatives-warning.p-4.b.i": "Derivative liquidity tokens should be redeemed from the same wallet used to purchase the token on uTrade. Transfering the tokens to another wallet and then attempting to redeem them may cause a failure in redemption.",
  "derivatives-warning.p-4.b.ii": "uTrade makes no statement of any value, use, redemption value, or legitimacy of any tokens traded on its site, including derivatives.",
  "derivatives-warning.p-4.d": "If the purchaser intends to redeem the derivative liquidity token, the wallet address used during trading should be the wallet address used to attempt to redeem the token. Redeeming from a new address may cause errors.",
  "derivatives-warning.p-4.e": "Derivative liquidity tokens are labeled by the platform that created them.",
  "derivatives-warning.p-4.e.i": "For example, the USDT liquidity token created by JustSwap will display as S-USDT.",
  "derivatives-warning.p-4.e.ii": "The USDT derivative liquidity token created by Unifi is uUSDT.",
  "derivatives-warning.p-5": "By pressing the “I Agree” button below and continuing, the user agrees:",
  "derivatives-warning.p-5.a": "Derivative tokens should only be traded by advanced users who understand and accept the nature of the derivative market, the inherent risks, and are closely monitoring the social media of Unifi and the platform(s) where the tokens originated.",
  "derivatives-warning.p-5.b": "Market conditions, updates by the token originator, or other factors may inhibit the ability of the user to redeem these tokens for any value.",
  "derivatives-warning.p-5.c": "Unifi makes no statement to warranty any financial value, authenticity, or ability to use, transact,exchange, or interact with in any way, tokens listed in uPairs on uTrade.",
  "derivatives-warning.p-5.d": "Trading in digital assets contains inherent risk, which the user attest to understanding, and includes but is not limited to the loss of involved funds.",
  "derivatives-warning.p-5.e": "The user understands it is their responsibility to determine if any activity on Unifi would violate any rule, law, regulatory oversight, or the rules/laws/regulations of any supervisory authority the user might be subject to. No offer for use of any Unifi Protocol platform or features is made anyone who is violating any rule/law/regulation by such use."
}